// Задача 68: Напишите программу вычисления функции Аккермана с 
// помощью рекурсии. Даны два неотрицательных числа m и n.

// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29
int InputNumber()
{
    int num = Convert.ToInt32(Console.ReadLine());
    return num;
}
int Akkerman(int m, int n)
{
    if (m == 0)
    {
        return n + 1;
    }
    else if ((m != 0) && (n == 0))
    {
        return Akkerman(m - 1, 1);
    }
    else
    {
        return Akkerman(m - 1, Akkerman(m, n - 1));
    }
}

Console.Write("Введите число m: ");
int num1 = InputNumber();
Console.Write("Введите число n: ");
int num2 = InputNumber();
Console.WriteLine(Akkerman(num1, num2));